Code/client/src/tests/stresstests/stress_client.yml
# Copyright Amazon.com, Inc. or its affiliates. All Rights Reserved.
# SPDX-License-Identifier: MIT-0

config:
  target: "http://a7087db35b0844d4daba6b05659ae068-1292505215.us-east-2.elb.amazonaws.com" # Updated with actual client ALB URL
  phases:
    - duration: 100
      arrivalRate: 20
  http:
    timeout: 5 # Wait 5 sec before aborting the request
    pool: 50 # Fixed number of pool connection, to be reused
scenarios:
  - name: "Generating load on the client fleet of tasks"
    flow:
      - loop:
          - get:
              url: "/" # Change me to "/" if necessary
        count: 10